<script setup>
    import Header from "../components/header.vue";
    import curlyPerson from "../assets/images/curly.svg";
    import thinkingPerson from "../assets/images/thinking.svg";

    import Slider from "../components/slider.vue";

    import image1 from "../assets/images/law-in-russian-empire/1.jpg";
    import image2 from "../assets/images/law-in-russian-empire/2.jpg";
    import image3 from "../assets/images/law-in-russian-empire/3.jpg";

    import image4 from "../assets/images/law-in-russian-empire/4.jpg";
    import image5 from "../assets/images/law-in-russian-empire/5.jpg";
    import image6 from "../assets/images/law-in-russian-empire/6.jpg";
    import image7 from "../assets/images/law-in-russian-empire/7.jpg";

    import image8 from "../assets/images/law-in-russian-empire/8.jpg";
    import image9 from "../assets/images/law-in-russian-empire/9.jpg";
    import image10 from "../assets/images/law-in-russian-empire/10.jpg";
    import image11 from "../assets/images/law-in-russian-empire/11.jpg";

    import { onMounted } from "vue";

    const slides1 = [{title:"«Никому на свете»\nне подотчетен — о ком это?", image: image1, modalText:["О царе-самодержце. Он не зависит ни от настроений народа, ни от закона, ни даже от Боярской думы. Источник его власти — лишь «воля Божья». В начале XVIII века такие полномочия концентрирует в своих руках Пётр I, первый абсолютный монарх и император Всероссийский, великий реформатор и автократ. «Его величество есть самовластный монарх, который никому на свете о своих делах ответу дать не должен», — читаем в «Артикуле воинском», первом российском военно-уголовном кодексе.", "Это «самовластие», или самодержавие, установилось в империи на два столетия. С одной стороны, абсолютизм был главным политическим трендом XVII—XVIII веков и давал государю колоссальные возможности. С другой — исключал развитие по-настоящему независимых правовых институтов."]}, 
                     {title:"Какие права есть\nу крепостного?", image: image2, modalText:["Власть абсолютного монарха опирается на лояльное дворянство. Дворянство же процветает за счет труда крепостных крестьян. Если дворяне могли занимать должности, заключать сделки, судиться и вообще выбирать свою судьбу, то крепостные были лишены даже базовых гражданских прав. Хочешь решить спор с соседом? Помещик рассудит. Половить рыбу? Главное, не в господском пруду. Жениться? Только с разрешения барина. Так было вплоть до отмены крепостного права 1861 году, когда царский манифест даровал крестьянам личную свободу."]}, 
                     {title:"Когда парламент\nбесполезен?", image: image3, modalText:["На протяжении двух веков царь оставался единоличным правителем России. Да, власть монарха усложнялась за счет разветвленной бюрократии. Да, с отменой крепостного права, появлением земств и независимых судов справедливости на местах стало больше. Но ничто из этого принципиально не ограничивало верховную власть самодержца. А что там с парламентом? Ни петровский Сенат, ни екатерининская Уложенная комиссия, ни александровский Госсовет им так и не стали.", "Настоящий двухпалатный парламент появляется в России только при Николае II под давлением революции 1905 года. Теперь закон мог быть принят лишь после одобрения Государственной Думой и Государственным Советом. При этом Госдума — нижняя палата парламента — избирается: в ней состоят депутаты от разных сословий, губерний и партий. Но половину Госсовета — верхней палаты — назначает император. Стоит ли удивляться, что большинство законопроектов, которые предлагает Дума, отклоняются. Мало того, два первых созыва Думы царь распускает, а вскоре вовсе меняет избирательную систему. Закрытый для оппозиции и лишенный реальной власти, парламент оказывается не у дел."]},]
                    //  {title:"", image: "", modalText:""}]
    const slides2 = [{title:"Зачем нужен\nСенат?", image: image4, modalText:["Правительствующий Сенат был создан Петром I как высший государственный орган из девяти человек, которые назначаются царем и подчиняются ему лично. Это своего рода «расширенный император»: Сенат принимает важнейшие государственные решения, составляет законы и сам же их принимает. Со временем его функции то дополнялись, то дробились, то передавались другим органам.", "В результате александровских реформ и вплоть до конца империи за Сенатом закрепилась роль высшей кассационной судебной инстанции. Что это значит? Именно туда на пересмотр отправится ваше дело, если суды на местах примут несправедливое, на ваш взгляд, решение."]}, 
                     {title:"Что ищет\n«око» государево?", image: image5, modalText:["Нарушения закона, в том числе со стороны высших чиновников. Именно для этого Петр I учредил должность генерал-прокурора — он обязан контролировать весь государственный аппарат и отчитываться императору лично. «Вот око моё, коим я буду всё видеть», — говорил Пётр, представляя прокурора сенаторам."]}, 
                     {title:"Как написать\nконституцию?", image: image6, modalText:["Можно взять все передовые достижения мирового права и составить проект документа, который опережает свое время и способен перевернуть страну. Так в качестве конституционного проекта при Александре I была составлена «Государственная уставная грамота Российской империи»: там и федеративное устройство, и двухпалатный парламент, и права человека. Но страх слишком резких, революционных изменений заставил императора поставить крест на этом проекте.", "Еще один путь — зафиксировать перемены, которые либо уже произошли, либо стали неизбежными. Так произошло в новой редакции «Основных государственных законов Российской империи». Этот документ Николай II принял под давлением революции 1905 года: царь был вынужден учредить независимый парламент и тем самым ограничить свою власть. Некоторые исследователи считают редакцию «Основных государственных законов» 1905 года чем-то вроде первой российской конституции."]},
                     {title:"Сколько законов действовало в Российской империи?", image: image7, modalText:["При Николае I правоведы собрали все законы, принятые в России со времен Соборного уложения. Получилось два огромных сборника: «Полное собрание законов» на 45 томов и «Свод государственных законов» на 16 томов. Это десятки тысяч правовых норм, по которым империя жила вплоть до своего крушения в 1917 году. Все эти законы были тщательно систематизированы: разложены по хронологии со ссылками, пояснениями и указаниями на погрешности."]},]
                    
    const slides3 = [{title:"Как стать судьей\nпри Петре I?", image: image8, modalText:["Чтобы получить назначение в нижний или надворный суд, введенные при Петре I, нужно быть человеком образованным, состоятельным, уважаемым. А еще в идеале — дружить с местным губернатором или воеводой, ведь именно исполнительная власть обеспечит вас помещением и секретарями. Примерно такая же ситуация с городскими магистратами: возглавлявшие их президенты вместе с бургомистрами и ратманами должны были разбирать дела купечества и мещанства. Это должности выборные, но вы не можете обойтись без поддержки местных элит, а за серьезную провинность царь может отправить вас «на азовские галеры»."]}, 
                     {title:"Как выглядел судебный процесс при Александре II?", image: image9, modalText:["Примерно так же, как выглядит сегодня. Если разбирается большое уголовное дело, то в зале помимо обвиняемого, потерпевших, судьи, прокурора и адвоката также присяжные заседатели, публика и пресса. Участвовать и присутствовать в суде могут представители всех сословий, в том числе крестьяне (не так давно переставшие быть собственностью помещиков или государства). Здесь действуют те же принципы справедливого суда, которые до сих пор считаются базовыми: независимость, устность, гласность, состязательность, презумпция невиновности. Судьи назначаются по указу императора, но их решения монарх отменить не может."]}, 
                     {title:"Всегда ли присяжные руководствуются законом?", image: image10, modalText:["Нет, далеко не всегда. По замыслу судебной реформы Александра II, присяжные заседатели приглашались к участию в процессах по серьезным уголовным преступлениям. Они выбирались жребием из самых обычных граждан разных сословий и голосованием определяли степень вины подсудимого. При этом присяжные часто руководствовались не буквой закона, а общечеловеческими представлениями о справедливости — особенно под влиянием ярких адвокатских речей. Так, например, присяжные принимали решение в деле Веры Засулич — самом громком политическом процессе пореформенной России (подробнее о нем рассказываем в нашем ролике)."]},
                     {title:"Великий русский адвокат — кто он?", image: image11, modalText:["Не просто юрист с блестящим образованием, успешной практикой и высокими гонорарами. Это также выдающийся оратор, общественный деятель и — часто — теоретик права. Федор Плевако, Дмитрий Стасов, Павел Александров, Владимир Спасович, Александр Урусов были в свое время настоящими знаменитостями. Они вытаскивали самые безнадежные дела, защищали, в том числе, нищих и бесправных, а их судебные речи печатались и становились легендарными."]},]
    
    onMounted(() => window.scrollTo(0, 0));

</script>

<template>
     <Header/>
     <main>
        <section class="w-10/12 sm:w-11/12 max-w-[1200px] flex flex-wrap flex-col lg:flex-row mx-auto my-12 lg:my-20">
            <div class="w-full lg:w-3/5 h-1/2 sm:h-3/5 lg:h-fit lg:mb-32 flex flex-wrap flex-col sm:flex-row gap-4 sm:gap-8">
                <span ref="wayBtn" class="subtitle text-nowrap helvetica-500 h-fit w-fit px-[clamp(16px,3.25vw,20px)] py-[clamp(4px,1.5vw,10px)] rounded-[clamp(10px,2.5vw,16px)] text-center bg-[#101fb3] text-white dark:bg-[#FF4800]">памятка</span>
                <h3 class="subtitle helvetica-400 h-fit my-auto dark:text-white">Россия: право сквозь века</h3>
                <h1 class="title helvetica-700 -mt-2 lg:h-1/6 max-w-[550px] dark:text-white">Право в Российской империи</h1>
            </div>
            <div class="w-full lg:w-2/5 min-h-[270px] sm:min-h-[285px] -mt-3 relative overflow-hidden lg:overflow-visible -z-10">  
                <img :src="thinkingPerson" alt="задумчевый парень" className="thinking-pos h-[clamp(285px,59vw,540px)] object-contain absolute"/>
                <img :src="curlyPerson" alt="кудрявый чел" className="curly-pos h-[clamp(285px,56vw,510px)] object-contain absolute"/>
            </div>
            <div class="w-full -translate-y-4 bg-white h-fit rounded-[clamp(20px,5vw,50px)] p-[clamp(24px,4vw,50px)]">
                <p class="w-full helvetica-400 line-height subtitle">
                    Став империей при Петре I, Россия обратилась к европейской модели развития и — по крайней мере на уровне высших сословий — сменила бороды на парики, взяв курс на просвещенный абсолютизм. Хотя на протяжении следующих двух столетий российская монархия оставалась самодержавной, внутри ее правовой системы успели созреть такие институты и принципы, которыми мы пользуемся до сих пор.
                </p>
            </div>
        </section>
        <section class="w-full max-w-[1280px] sm:mx-auto h-hit relative mt-[clamp(45px,7vw,90px)]">
            <Slider title="Государство и общество" :items="slides1"/>

            <Slider title="Правовая система" :items="slides2"/>
            
            <Slider title="Судебная система и судебный процесс" :items="slides3"/>
        </section>
     </main>
</template>

<style scoped>
    .curly-pos{
        top: -4vw;
        right: 0;
    }

    .thinking-pos{
        right: 32%;
        top: 10px;
    }

    @media (min-width: 450px) {
        .thinking-pos{right: 20vw;}
    }

    @media (min-width: 640px) {
        .thinking-pos{top: -10px; right: 16vw;}
        .curly-pos{right: -26px; top: -30px;}
    }

    @media (min-width: 1024px) {
        .thinking-pos{right: 45%; top: 0;}
        .curly-pos{top: -10px; right:28px}
    }
</style>