<script setup>
    import Header from "../components/header.vue";
    import gopnikOne from "../assets/images/gopnik-one.svg";
    import gopnikTwo from "../assets/images/gopnik-two.svg";

    import Slider from "../components/slider.vue";

    import image1 from "../assets/images/law-in-soviet-russia/1.jpg";
    import image2 from "../assets/images/law-in-soviet-russia/2.jpg";
    import image3 from "../assets/images/law-in-soviet-russia/3.jpg";

    import image4 from "../assets/images/law-in-soviet-russia/4.jpg";
    import image5 from "../assets/images/law-in-soviet-russia/5.jpg";
    import image6 from "../assets/images/law-in-soviet-russia/6.jpg";
    import image7 from "../assets/images/law-in-soviet-russia/7.jpg";

    import image8 from "../assets/images/law-in-soviet-russia/8.jpg";
    import image9 from "../assets/images/law-in-soviet-russia/9.jpg";
    import image10 from "../assets/images/law-in-soviet-russia/10.jpg";

    import { onMounted } from "vue";

    const slides1 = [{title:"За что и против кого\nборолись большевики?", image: image1, modalText:["Основанная Владимиром Лениным партия большевиков ставила своей целью установление диктатуры пролетариата. Именно так, согласно учению Карла Маркса, можно построить коммунистическое общество — равное и справедливое, в котором нет частной собственности, а государство представляет интересы народа. Но к моменту падения монархии большевики были далеко не единственной политической силой. Свое видение обновленной России было у партий кадетов, октябристов, эсеров, меньшевиков… Только вот Ленин и его соратники не собирались ни с кем делить власть. Они совершили Октябрьский переворот и разогнали Учредительное собрание, на котором депутаты от разных партий должны были принять новые принципы государственного устройства. А потом — подавили сопротивление в ходе Гражданской войны и установили советскую власть почти в тех же границах, в которых существовала Российская империя."]}, 
                     {title:"Как социализм изменил Россию?", image: image2, modalText:["На месте бывшей империи в 1922 году был создан Союз Советских Социалистических Республик. По Конституции, республики стали частью Союза по доброй воле и могли выйти из него любой момент. На практике СССР стал сверхцентрализованным государством: все ключевые решения принимались в Москве и директивно «спускались сверху». Партии и советы — в теории независимые друг от друга — на деле подчинялись одним и тем же политическим доктринам.", "Земли и фабрики, школы и больницы, кино и тарелки в столовых — почти все стало государственным, превратилось в «социалистическую собственность». Вместо свободного рынка советская власть построила плановую экономику: теперь центр решал, что и сколько производить, где и как это продавать. Что все это значило для простого советского человека? Он бесплатно получал социальные блага, гарантии и льготы. Но мог лишиться дома, свободы и даже жизни, если его признают «кулаком» или «врагом народа», — в любом случае он оставался только винтиком в большой государственной машине и никак не мог влиять на выбор направления, в котором она едет."]}, 
                     {title:"В чем разница между колхозом и кооперативом?", image: image3, modalText:["Социализм провозглашал следующее; капитал (то есть все средства производства) находится в руках самих трудящихся и работает на них. Но за время существования СССР этот принцип воплощался по-разному.", "С 1929 года после постановления партийного пленума в стране массово появляются колхозы. Это сельскохозяйственные артели, которым часть земли и капитала (государственных, разумеется) передается в безвозмездное пользование. Государство же обеспечивает колхоз техникой, спускает план, платит за продукцию. С другой стороны, советский гражданин, который хотел работать «на земле», фактически не мог выбирать, в какой форме это делать. Неслучайно фразе: «Колхоз — дело добровольное» из романа Шолохова «Поднятая целина» народная память придумала продолжение: «Хочешь — вступай, не хочешь — расстреляем».", "На совершенно других условиях в конце 1980-х создаются кооперативы. Государство стимулирует их появление серией законов в ответ на затяжной кризис плановой экономики с постоянными товарными дефицитами. Такие кооперативы коллектив трудящихся создает добровольно и зарабатывает деньги так, как считает нужным. Для этого, правда, нужны задатки предпринимателя — неслучайно некоторые выходцы из среды кооператоров впоследствии оказались в российском списке Forbes."]},]
                    //  {title:"", image: "", modalText:""}]
    const slides2 = [{title:"О чем были первые\nдекреты советской власти?", image: image4, modalText:["Декреты — решения правительства большевиков, которые были приняты в первые дни после Октябрьского переворота и касались самых злободневных вопросов. «Декрет о мире» предлагал немедленно закончить Первую мировую войну. «Декрет о земле» провозглашал переход всей земли в собственность народа. Исполнение этих решений — беспрецедентных по своим масштабам — большевики детально не прописывали. В тот момент декреты должны были помочь советам удержать власть, заручившись поддержкой народа. А для этого нужны были простые и радикальные меры. Пригодившиеся «в моменте», декреты в итоге повлияли на ход истории, став залогом существования советского государства."]}, 
                     {title:"Как страна меняла конституции?", image: image5, modalText:["В общей сложности СССР сменил три конституции (еще одна — конституция РСФСР — была принята большевиками до образования Союза). Конституция 1924 года провозглашала равенство и суверенитет советских республик.", "Следующая — так называемая «Сталинская» — конституция 1936 года вовсе считалась одной из самых демократичных. В ней прописаны всеобщее избирательное право, свобода совести, слова, печати, собраний и митингов (ценности, так и оставшиеся декларациями — провозглашенные лишь на бумаге).", "Наконец, «Брежневская» конституция 1977 года закрепила руководящую роль коммунистической партии в знаменитой шестой статье. Одиннадцать лет спустя во многом ради отмены этого принципа была затеяна большая конституционная реформа. Согласно закону 1988 года, реальная власть переходила от партийной бюрократии к Съезду народных депутатов и Верховному Совету. С этими изменениями конституция просуществовала всего три года — до распада СССР."]}, 
                     {title:"Как «оттепель» и «застой» изменили право?", image: image6, modalText:["Период, когда Советский Союз возглавлял Никита Хрущёв, называют «оттепелью» — на контрасте со сталинской эпохой. В этот период были реабилитированы тысячи репрессированных, расширились экономические автономии республик, а некоторые депортированные народы получили право вернуться на родину. Началась работа по систематизации законодательства в сферах уголовного права, гражданского права и судопроизводства. В этот же период сформировалась советская правовая школа: ее представители использовали достижения юридической науки в развитии советских правовых институтов. Эпоху Леонида Брежнева называют «застоем» из-за стагнации экономики и внутренней политики СССР. Но в правовой системе изменилось многое. Помимо новой конституции в этот период были приняты законы «О Верховном Суде СССР» и «Об адвокатуре». Формировались целые отрасли права: трудового, хозяйственного, земельного, экологического, законы об административных правонарушениях. Все это важные достижения советского правотворчества."]},
                     {title:"Что перестроила\n«перестройка»?", image: image7, modalText:["«Перестройка», инициированная в 1985 году новым генеральным секретарем ЦК КПСС Михаилом Горбачевым, дала старт реформам во всех сферах жизни страны. В экономике — кооперация и элементы свободного рынка. В обществе — «гласность» и «демократизация». В политике — выборность, многопартийность и ротация руководящих кадров. Все эти перемены закреплялись конституционной реформой и новыми законами. Но реформы Горбачева уже не могли преодолеть кризис советской системы, часто лишь обнажали и усугубляли назревшие противоречия. Так «перестройка» в итоге обернулась «демонтажом» СССР."]},]
                    
    const slides3 = [{title:"Что такое революционная законность?", image: image8, modalText:["В первые годы советской власти революционной законностью оправдывались все самые радикальные решения большевиков. Насилие, внесудебные казни, отъем имущества — то, что обычно считается преступным — стало допустимым, если совершалось от лица государства и отвечало высшей цели — установлению советской власти и нового справедливого общества. В 1918 году Ленин говорил об этом прямо: «Законы в переходное время имеют временное значение. И если закон препятствует развитию революции, он отменяется или исправляется»."]}, 
                     {title:"Чем страшны\n«тройки»?", image: image9, modalText:["«Особыми тройками» называется формат уголовного процесса в сталинском СССР. Это комиссии из партийного руководителя, прокурора и начальника областного НКВД. Они выносят решения в закрытом и ускоренном режиме. Судья в этом не участвует. Нет ни адвоката, ни прокурора, ни самого принципа состязательности. Чтобы приговорить обвиняемого, например, к расстрелу или 10 годам лагерей (по печально известной «политической» 58-й статье), зачастую доказательства подменяли протоколами НКВД или вовсе списками «виновных», заверенными подписями начальства."]}, 
                     {title:"Как выглядел судебный процесс в 1970-х?", image: image10, modalText:["Представим процесс в основном звене судебной системы — районном или городском суде. Он рассматривает большую часть гражданских и уголовных дел. Такой суд называется народным, ведь в президиуме помимо председательствующего судьи состоят еще два народных заседателя из числа обычных граждан. Однако в том самом «народе» таких заседателей за глаза называют «кивалами», ведь чаще всего они просто подтверждают решения судьи, поддаваясь его профессиональному авторитету. Но даже без активного участия заседателей устройство позднесоветского уголовного процесса допускало и состязательность, и честность.", "Возможно, вы помните, как выглядела знаменитая сцена суда в фильме Георгия Данелии «Мимино». Главный герой был обвинен в хулиганстве за нападение на своего земляка Нугзара. Мимино сидит на скамье подсудимых, на стороне обвинения выступает прокурор, на стороне защиты — адвокат: она работает по назначению от государства, подсудимый ничего ей не платит.", "Судья и народные заседатели по очереди выслушивают всех участников процесса. Только вот свидетель защиты Рубен простодушно путается в показаниях и невольно «закапывает» своего приятеля — история начинает выглядеть как ничем не мотивированная агрессивная выходка. Но тут на помощь приходит адвокат: юрист находит доказательства того, что у Мимино была личная неприязнь к потерпевшему: когда-то Нугзар соблазнил и бросил его сестру. Это важное, документально подтвержденное обстоятельство смягчает вину подсудимого. Вместо нескольких лет заключения, грозивших Мимино изначально, суд назначает ему лишь штраф с компенсацией ущерба."]},]
   
    onMounted(() => window.scrollTo(0, 0));

</script>

<template>
     <Header/>
     <main>
        <section class="w-10/12 sm:w-11/12 max-w-[1200px] flex flex-wrap flex-col lg:flex-row mx-auto my-12 lg:my-20">
            <div class="w-full lg:w-3/5 h-1/2 sm:h-3/5 lg:h-fit lg:mb-40 xl:mb-28 flex flex-wrap flex-col sm:flex-row gap-4 sm:gap-8">
                <span ref="wayBtn" class="subtitle text-nowrap helvetica-500 h-fit w-fit px-[clamp(16px,3.25vw,20px)] py-[clamp(4px,1.5vw,10px)] rounded-[clamp(10px,2.5vw,16px)] text-center bg-[#101fb3] text-white dark:bg-[#FF4800]">памятка</span>
                <h3 class="subtitle helvetica-400 h-fit my-auto dark:text-white">Россия: право сквозь века</h3>
                <h1 class="title helvetica-700 -mt-2 lg:h-1/6 max-w-[550px] dark:text-white">Право в советской России</h1>
            </div>
            <div class="w-full lg:w-2/5 min-h-[270px] sm:min-h-[285px] -mt-3 relative overflow-hidden lg:overflow-visible -z-10 xl:-translate-y-8">  
                <img :src="gopnikOne" alt="интеллигентный советский гопник" className="gopnik-pos h-[clamp(285px,59vw,540px)] object-contain absolute z-10"/>
                <img :src="gopnikTwo" alt="советский гопарь" className="intellectual-pos h-[clamp(285px,56vw,510px)] object-contain absolute"/>
            </div>
            <div class="w-full -translate-y-4 bg-white h-fit rounded-[clamp(20px,5vw,50px)] p-[clamp(24px,4vw,50px)]">
                <p class="w-full helvetica-400 line-height subtitle">
                    С 1917 года Россия прошла через крупнейшие военные конфликты, сменила несколько конституций и пережила десятки реформ, менявших сами основы государственного и общественного устройства. Все это нашло отражение в истории советского права, от первых большевистских декретов до горбачевской «перестройки».
                </p>
            </div>
        </section>
        <section class="w-full max-w-[1280px] sm:mx-auto h-hit relative mt-[clamp(45px,7vw,90px)]">
            <Slider title="Государство и общество" :items="slides1"/>

            <Slider title="Правовая система" :items="slides2"/>
            
            <Slider title="Судебная система и судебный процесс" :items="slides3"/>

            <!-- <Slider title="Судебная система и судебный процесс" :items="slides3"/> -->
        </section>
     </main>
</template>

<style scoped>
    .intellectual-pos{
        top: -2vw;
        right: 0;
    }

    .gopnik-pos{
        right: 32%;
        top: 15px;
    }

    @media (min-width: 450px) {
        .gopnik-pos{right: 20vw;}
    }

    @media (min-width: 640px) {
        .gopnik-pos{top: 20px; right: 17vw;}
        .intellectual-pos{right: -26px; top: -10px;}
    }

    @media (min-width: 1024px) {
        .gopnik-pos{right: 40%; top: -10px;}
        .intellectual-pos{top: 0; right:0}
    }

    @media (min-width: 1280px) {
        .gopnik-pos{right: 53%; top: 30px;}
        .intellectual-pos{top: -20px; right:10%}
    }
</style>