<script setup>
    import Header from "../components/header.vue";
    import bogatyr from "../assets/images/bogatyr.svg";
    import yakuza from "../assets/images/yakuza.svg";

    import Slider from "../components/slider.vue";

    import image1 from "../assets/images/medieval-law/1.jpg";
    import image2 from "../assets/images/medieval-law/2.jpg";
    import image3 from "../assets/images/medieval-law/3.jpg";

    import image4 from "../assets/images/medieval-law/4.jpg";
    import image5 from "../assets/images/medieval-law/5.jpg";
    import image6 from "../assets/images/medieval-law/6.jpg";

    import image7 from "../assets/images/medieval-law/7.jpg";
    import image8 from "../assets/images/medieval-law/8.jpg";
    import image9 from "../assets/images/medieval-law/9.jpg";
    import image10 from "../assets/images/medieval-law/10.jpg";

    import { onMounted } from "vue";

    const slides1 = [{title:"Чему научилась Русь\nв монгольский период?", image: image1, modalText:["Помимо разрушений, кризиса и «испития чаши смертной» кочевники принесли на Русь новую систему налогообложения. Сначала дань со всех жителей Руси (за исключением духовенства) собирали ханские наместники — баскаки.", "Но вскоре ордынцы ввели систему «ярлыков на княжение». Вместе с ярлыком местные правители получали от хана всю полноту власти на местах: делай что хочешь, только привози дань в срок. Это касалось и управления экономикой княжеств, в том числе сбора оброка. За такой карт-бланш удельные князья шли на любые условия хана и конкурировали между собой. Сначала это только усугубляло феодальную раздробленность, но со временем обернулось против монголов: отдельные русские княжества захотели больше власти и влияния."]}, 
                     {title:"Чем закончилось\n«собирание земель»?", image: image2, modalText:["К середине XV века правила игры изменились. Московское княжество «поглощало» соседей-конкурентов и в итоге укрепилось настолько, что перестало платить дань слабеющей Золотой Орде. Символическим финалом почти 250-летнего владычества монголов считается «великое стояние на реке Угре» — бескровная встреча русских и монголов, которая так и не переросла в битву. Князь Иван III становится полновластным «Государем всея Руси». После падения Византии столица его владений берет на себя роль центра православного мира: отныне «Москва — третий Рим».", "Что нужно для управления разросшимся государством? Воля монарха, войско, идеология, и, конечно, бюрократия. Наместники и приказы (прообразы министерств) распространяли власть государя, но до цельной системы государства и права было еще далеко."]}, 
                     {title:"Как развивалось Русское царство?", image: image3, modalText:["Начиная с Ивана Грозного российские правители носили титул царя — вслед за византийскими «кесарями». Тогда же Россия перенимает «от греков» обряд венчания на царство: власть царя наделяется высшим духовным смыслом, отныне он — «помазанник Божий».", "В начале «бунташного» XVII века Русское царство переживало непростые времена. Смута, восстания, смена династий, церковный раскол проверяли государство на прочность, но не помешали ему подойти к концу столетия в статусе устойчивой монархии с огромной территорией, от Прикаспия до Сибири. В этой большой и сложной стране активно развивались торговля и финансы, суды и уголовное право, а еще действовал первый печатный свод законов — Соборное уложение."]},]
                    //  {title:"", image: "", modalText:""}]
    const slides2 = [{title:"Кто следил за порядком\nв удельном княжестве?", image: image4, modalText:["Князь и его дружина. Но ровно до этого момента, пока его не сменит наследник или не сместит другой князь. Закон Средних веков — это прежде всего право сильного, помноженное на власть традиции.", "На Руси по-прежнему применялись нормы Русской Правды, но с поправкой на местные правовые обычаи. Так, например, в присоединенных Москвой землях действовали Двинская уставная грамота и Белозёрская судная грамота, а в Пскове — собственная судная грамота, в которой проявились республиканские традиции. У каждой земли — свой закон. Средневековая Русь долгое время оставалась раздробленной, в том числе с точки зрения правовых обычаев."]}, 
                     {title:"Как Русь пыталась жить\nпо единым законам?", image: image5, modalText:["В период усиления Москвы функции и судебной, и исполнительной власти брали на себя государевы наместники и воеводы. А чуть позже — приказы во главе с боярами, губные и земские избы на местах. Государственный аппарат только складывался, еще без строгого разделения полномочий. Кумовству, взяточничеству и пыточным практикам такой порядок способствовал вполне, а вот правовой прозрачности — не очень. К тому же чиновники часто записывали новые нормативные акты в приказные книги, но не публиковали их. Поэтому вы могли просто не знать, что в данный момент законно, а что нет. В попытке собрать весь этот ворох правовых норм в 1497 году Иван III и Боярская дума принимают Судебник — первый единый свод законов Московской Руси. На следующие 150 лет именно Судебник стал основным документом в правовой системе страны."]}, 
                     {title:"Почему Соборное уложение стало бестселлером?", image: image6, modalText:["Это был передовой для своего времени документ — первый в России закон в современном понимании этого слова. Соборное уложение 1649 года объединило в себе достижения русского и зарубежного права, было принято Земским собором с представителями самых разных сословий. Как первый печатный закон, уложение быстро разошлось среди чиновников и народа, при этом допечатывать тираж приходилось вновь и вновь. Издание пользовалось спросом, ведь впервые жители могли прочесть, по каким законам жить. Неслучайно нормы Соборного уложения действовали в России следующие два века."]},]
                    
    const slides3 = [{title:"Где записывались судебные решения?", image: image7, modalText:["В множестве разных книг — княжеских уставах и правдах, которые в свою очередь переписывались в более крупные сборники — ту же Русскую Правду. Большим шагом в сторону более строгой, системной и полной кодификации право стали Судебник Ивана III и Соборное уложение."]}, 
                     {title:"Что делать, если судья не прав?", image: image8, modalText:["«Бить челом» царю — то есть написать на судью жалобу (она так и называлась — «челобитная»). Если вам повезет, государь его накажет (например, прикажет выплатить штраф вместо вас), но само решение не отменит. До появления процедуры апелляции оспорить решения судьи можно было лишь так."]}, 
                     {title:"Кто вёл\nрасследования?", image: image9, modalText:["В эпоху Московского царства земские и губные избы принимали судебные решения и сами же их исполняли. Это были выборные органы, которые занимались самыми разными вопросами. Если земские чиновники, как правило, вели сбор налогов и гражданские споры, то губные — расследовали уголовные дела: разыскивали преступников, судили и пытали их (этот метод дознания был узаконен Судебником)."]},
                     {title:"Кто такие\n«судные мужи»?", image: image10, modalText:["Представители народа, которые присутствовали на заседании в качестве наблюдателей. Когда рассматривалась жалоба на судью, они могли подтвердить или опровергнуть показания стороны о ходе процесса — сообщить, насколько честно судья рассматривал дело."]},]
               
    onMounted(() => window.scrollTo(0, 0));
    
</script>

<template>
     <Header/>
     <main>
        <section class="w-10/12 sm:w-11/12 max-w-[1200px] flex flex-wrap flex-col lg:flex-row mx-auto my-12 lg:my-20">
            <div class="w-full lg:w-3/5 h-1/2 sm:h-3/5 lg:h-fit lg:mb-56 flex flex-wrap flex-col sm:flex-row gap-4 sm:gap-8">
                <span ref="wayBtn" class="subtitle text-nowrap helvetica-500 h-fit w-fit px-[clamp(16px,3.25vw,20px)] py-[clamp(4px,1.5vw,10px)] rounded-[clamp(10px,2.5vw,16px)] text-center bg-[#101fb3] text-white dark:bg-[#FF4800]">памятка</span>
                <h3 class="subtitle helvetica-400 h-fit my-auto dark:text-white">Россия: право сквозь века</h3>
                <h1 class="title helvetica-700 -mt-2 lg:h-1/6 w-full overflow-hidden max-w-[550px] dark:text-white">Средневековое право</h1>
            </div>
            <div class="w-full lg:w-2/5 min-h-[310px] sm:min-h-[285px] -mt-3 relative overflow-hidden lg:overflow-visible -z-10">  
                <img :src="bogatyr" alt="богатырь" className="bogatyr-pos h-[clamp(280px,55vw,540px)] object-contain absolute z-10"/>
                <img :src="yakuza" alt="якудза" className="yakuza-pos h-[clamp(315px,60vw,580px)] object-contain absolute"/>
            </div>
            <div class="w-full -translate-y-4 bg-white h-fit rounded-[clamp(20px,5vw,50px)] p-[clamp(24px,4vw,50px)]">
                <p class="w-full helvetica-400 line-height subtitle">
                    За четыре века Русь превратилась из «лоскутного одеяла» маленьких враждующих княжеств в централизованную монархию. Настолько же длинный путь прошла ее правовая система — от разрозненных обычаев до обширного всенародно принятого Соборного уложения.
                </p>
            </div>
        </section>
        <section class="w-full max-w-[1280px] sm:mx-auto h-hit relative">
            <Slider title="Государство и общество" :items="slides1"/>

            <Slider title="Правовая система" :items="slides2"/>
            
            <Slider title="Судебная система и судебный процесс" :items="slides3"/>
        </section>
     </main>
</template>

<style scoped>
    .yakuza-pos{
        top: -3vw;
        right: -2.5%;
    }

    .bogatyr-pos{
        right: 32%;
        top: 30px;
    }

    @media (min-width: 450px) {
        .bogatyr-pos{right: 20vw;}
    }

    @media (min-width: 640px) {
        .bogatyr-pos{top: 0; right: 19vw;}
        .yakuza-pos{right: -21px; top: -30px;}
    }

    @media (min-width: 1024px) {
        .bogatyr-pos{right: 36%; top: -70px;}
        .yakuza-pos{top: -125px; right: -10px;}
    }

    @media (min-width: 1280px) {
        .bogatyr-pos{top:45px;}
        .yakuza-pos{top: -10px; right: 0;}
    }
</style>