<script setup>
    import Header from "../components/header.vue";
    import worker from "../assets/images/worker.svg"; //Рабочий
    import decided from "../assets/images/decided.svg"; //Решала
    import judge from "../assets/images/judge.svg"; //Судья

    import Slider from "../components/slider.vue";

    import image1 from "../assets/images/modern-law/1.jpg";
    import image2 from "../assets/images/modern-law/2.jpg";
    import image3 from "../assets/images/modern-law/3.jpg";

    import image4 from "../assets/images/modern-law/4.jpg";
    import image5 from "../assets/images/modern-law/5.jpg";
    import image6 from "../assets/images/modern-law/6.jpg";

    import image7 from "../assets/images/modern-law/7.jpg";
    import image8 from "../assets/images/modern-law/8.jpg";
    import image9 from "../assets/images/modern-law/9.jpg";

    const slides1 = [{title:"Как поссорились\nпрезидент и парламент?", image: image1, modalText:["Сразу после распада СССР в 1991 году высшими органами государственной власти в России оставались Съезд народных депутатов и Верховный Совет (руководивший страной между сессиями Съезда). При этом президент РСФСР Борис Ельцин как глава исполнительной власти продолжал принимать важнейшие решения в форме указов, это явление даже получило особое название — «указное право». В ситуации, когда новая конституция еще не была принята, баланс политических сил нарушился, а парламент и президент совершенно по-разному видели стратегию реформ, конфликт между двумя ветвями власти стал неизбежен.", "Осенью 1993 года Ельцин распустил Съезд и Совет — в нарушение еще действовавшей «советской» конституции РСФСР. Депутаты в свою очередь объявили об отставке президента. Конфликт вылился в вооруженные столкновения на улицах Москвы. В те дни мир облетели кадры боев у телецентра Останкино и штурма Белого дома. В итоге президент одержал победу, а вместо Съезда и Советов был сформирован новый парламент — Федеральное Собрание, состоящий из двух палат — Государственной Думы и Совета Федерации."]}, 
                     {title:"Что принес в Россию свободный рынок?", image: image2, modalText:["Переход России к рыночной экономике означал поворот ее общественно-государственного устройства на 180 градусов — уже второй раз за 70 лет. Государственные земля, предприятия, имущество теперь приватизировались, то есть передавались в частную собственность. Цены, которые раньше удерживались планом, отправились «в свободное плавание». Страна открылась глобальному рынку, который вместе с товарным изобилием принес ей банкротство целых отраслей промышленности, не выдержавших конкуренции.", "Реформы обернулись социальными потрясениями, ведь большинство граждан не было готово к настолько резкой смене «правил игры». Право тоже вынуждено адаптировалось к капиталистическим реалиям. В 1990-е принимаются законы о новых типах организаций: акционерных обществах, некоммерческих организациях и обществах с ограниченной ответственностью. Формируется законодательство, регулирующее работу банков, бирж, розничной торговли. Обновляется сфера гражданского права, без которой невозможно представить общество со свободным рынком."]}, 
                     {title:"Чья земля?", image: image3, modalText:["До 1991 года вся земля в стране была де-факто государственной. Даже те самые бабушкины «шесть соток» передавались гражданину лишь в пользование, пусть и бессрочное. После распада Советского Союза идея приватизации земли вызвала не менее широкий резонанс, чем ее национализация в 1917-м. Земельный кодекс, принятый в первый год независимости РСФСР и вызвавший бурные споры, в итоге пришлось значительно переделывать. Новый Земельный кодекс вступил в силу лишь десять лет спустя. В нем земля рассматривается уже в свете экологической повестки: в первую очередь как природный ресурс и лишь потом как объект недвижимости. Владеть землёй могут частные граждане и организации, муниципалитеты, регионы и сама Российская Федерация."]},]
                    //  {title:"", image: "", modalText:""}]
    const slides2 = [{title:"Что гарантирует вам\nсовременная конституция?", image: image4, modalText:["Действующая сегодня конституция была принята всенародным голосованием 12 декабря 1993 года. Она закрепляет федеративное устройство страны с равенством всех субъектов и принцип разделения властей. Президент объявляется главой государства: он определяет внешнюю и внутреннюю политику, руководит вооружёнными силами, формирует Правительство, назначает и снимает с постов федеральных чиновников.", "Высшей ценностью провозглашается человек, его права и свободы. Вам, как и любому гражданину, гарантируется — среди прочего — право на выбор веры, тайну переписки, личную неприкосновенность, защиту частной жизни. Никто не вправе без вашего согласия переходить порог вашего дома и ограничивать ваши перемещения по стране, иначе как в случаях, установленных федеральным законом, или на основании судебного решения. Никто не может запрещать вам творчески выражать себя и владеть собственностью. При этом Конституция — это закон прямого действия, то есть на нее можно ссылаться, защищая свои права, даже если для какой-то ситуации нет конкретной нормы права."]}, 
                     {title:"Когда вы живете\nпо Гражданскому кодексу?", image: image5, modalText:["Когда заказываете такси или арендуете велосипед, покупаете билеты в театр или оформляете подписку на «Синхронизацию», а еще в сотне других ситуаций, который происходят с вами буквально каждый день… Как это возможно? Дело в том, что Гражданский кодекс регулирует обширную сферу гражданско-правовых отношений, в которые вы вступаете, когда совершаете даже мелкие сделки, не глядя ставите «галочку» в оферте или взаимодействуйте с интеллектуальной собственностью, которой считается и пост на пару строчек, и новый классный сериал. Неслучайно работа над Гражданским кодексом шла больше десяти лет, с 1994-го по 2006 год, Сегодня это огромный документ из четырёх частей, который называют «экономической конституцией»."]}, 
                     {title:"Бывают ли законы\nдля семейной жизни?", image: image6, modalText:["Да, и речь, конечно, не о «Домострое». Обширная сфера семейного права регулируется сегодня сразу несколькими федеральными законами. Так, благодаря Семейному кодексу можно заключить брачный договор, отстоять личную независимость в браке, взять под опеку приёмного ребёнка, справедливо разделить имущество при разводе, получить алименты.", "Дети защищаются законом «Об основных гарантиях прав ребёнка». В нем прописаны право жить и воспитываться в семье, общаться с родными, находиться в безопасности. Еще ребенок может выражать свое мнение по всем вопросам, которые его касаются, и владеть имуществом, даже если живет в доме с родителями (так что взять плюшевого зайца без его разрешения, увы, не получится)."]},]
                    
    const slides3 = [{title:"Что перестало быть преступлением?", image: image7, modalText:["Когда заказываете такси или арендуете велосипед, покупаете билеты в театр или оформляете подписку на «Синхронизацию», а еще в сотне других ситуаций, который происходят с вами буквально каждый день… Как это возможно? Дело в том, что Гражданский кодекс регулирует обширную сферу гражданско-правовых отношений, в которые вы вступаете, когда совершаете даже мелкие сделки, не глядя ставите «галочку» в оферте или взаимодействуйте с интеллектуальной собственностью, которой считается и пост на пару строчек, и новый классный сериал. Неслучайно работа над Гражданским кодексом шла больше десяти лет, с 1994-го по 2006 год, Сегодня это огромный документ из четырёх частей, который называют «экономической конституцией»."]}, 
                     {title:"Какие суды есть\nсегодня в России?", image: image8, modalText:["Если вы обычный гражданин, то при необходимости пойдете в суд одной из двух основных категорий. Это может быть арбитражный суд: туда обращаются для решения экономических споров, например если поставщик вашей кофейни прислал некачественную эспрессо-машину и теперь вы решили взыскать неустойку.", "Вторая категория — суды общей юрисдикции, которые занимаются всем остальным, будь то раздел имущества при разводе, оспаривание штрафа за вождение, курение на детской площадке или кража домашней капибары.", "Оспорить несправедливое, на ваш взгляд, решение можно в апелляционном и кассационном судах. Высшей инстанцией как для арбитражных судов, так и для судов общей юрисдикции, выступает Верховный суд.", "Особое место в этой системе занимает Конституционный суд — он проверяет российские законы на соответствие Конституции и разрешает споры о полномочиях между государственными органами."]}, 
                     {title:"Как часто обновляется\nКоАП?", image: image9, modalText:["За смешной аббревиатурой КоАП скрывается серьезный документ — Кодекс об административных правонарушениях. С ним приходится сталкиваться тем, кто решает нецензурно поругаться на улице, обмануть покупателя или припарковаться на газоне. Это не только один из самых больших, но и один из самых редактируемых законов. Только представьте: с момента вступления в силу в 2001 году до января 2020 года в него внесли более 4800 изменений и дополнений!"]},]
        
</script>

<template>
     <Header/>
     <main>
        <section class="w-11/12 max-w-[1200px] flex flex-wrap flex-col lg:flex-row mx-auto my-12 lg:my-20">
            <div class="w-full lg:w-3/5 h-1/2 sm:h-3/5 lg:h-fit lg:mb-56 xl:mb-52 flex flex-wrap flex-col sm:flex-row gap-4 sm:gap-8">
                <span ref="wayBtn" class="subtitle text-nowrap helvetica-500 h-fit w-fit px-[clamp(16px,3.25vw,20px)] py-[clamp(4px,1.5vw,10px)] rounded-[clamp(10px,2.5vw,16px)] text-center bg-[#101fb3] text-white dark:bg-[#FF4800]">памятка</span>
                <h3 class="subtitle helvetica-400 h-fit my-auto dark:text-white">Россия: право сквозь века</h3>
                <h1 class="title helvetica-700 -mt-2 lg:h-1/6 max-w-[550px] dark:text-white">Современное право</h1>
            </div>
            <div class="w-full lg:w-2/5 min-h-[310px] sm:min-h-[340px] -mt-3 relative overflow-hidden lg:overflow-visible -z-10">  
                <img :src="worker" alt="рабочий" className="worker-pos h-[clamp(300px,59vw,515px)] object-contain absolute z-10"/>
                <img :src="judge" alt="судья" className="judge-pos h-[clamp(300px,58vw,520px)] object-contain absolute z-10"/>
                <img :src="decided" alt="решала" className="decided-pos translate-x-1 h-[clamp(275px,55vw,475px)] object-contain absolute"/>
            </div>
            <div class="w-full -translate-y-4 bg-white lg:min-h-[360px] h-fit rounded-[clamp(20px,5vw,50px)] p-[clamp(24px,4vw,50px)]">
                <p class="w-full helvetica-400 line-height subtitle">
                    Более 30 лет назад Советский Союз прекратил свое существование, и Россия полностью сменила модель развития — в очередной раз за свою историю. Адаптируясь к резким изменениями государства и общества, правовая система корректировала одни механизмы на ходу, а другие буквально выстраивала с нуля. На базе собственного прошлого и мирового опыта российское право превратилось в разветвленную систему, которая сегодня влияет на нашу жизнь изо дня в день (даже если мы этого не замечаем).
                </p> 
                <!-- <p class="w-full helvetica-400 subtitle">
                    В этой памятке собрали главные факты из истории древнерусского права — ответы на «стыдные» вопросы о власти, правовых обычаях и судах.
                </p> -->
            </div>
        </section>
        <section class="w-full max-w-[1280px] sm:mx-auto h-hit relative">
            <Slider title="Государство и общество" :items="slides1"/>

            <Slider title="Правовая система" :items="slides2"/>
            
            <Slider title="Судебная система и судебный процесс" :items="slides3"/>
        </section>
     </main>
</template>

<style scoped>
    .worker-pos{
        top: 25px;
        right: 38%;
    }

    .judge-pos{
        right: 13%;
        top: 70px;
    }

    .decided-pos{
        top: 25px;
        right: -6px;
    }



    @media (min-width: 640px) {
        .worker-pos{
            top: -10px;
            right: 28vw;
        }

        .judge-pos{
            right: 9vw;
            top: 37px;
        }

        .decided-pos{
            top: -10px;
            right: -5px;
        }
    }

    @media (min-width: 1024px) {
        .worker-pos{
            top: 12px;
            right: 16vw;
        }

        .judge-pos{
            right: 4vw;
            top: 80px;
        }

        .decided-pos{
            top: 25px;
            right: -25px;
        }
    }

    @media (min-width: 1280px) {
        .worker-pos{
            top: 0;
            right:57%;
        }

        .judge-pos{
            right: 29%;
            top: 57px;
        }

        .decided-pos{
            top: -5px;
            right: 14%;
        }
    }
</style>